app/controllers/home_controller.rb

  def get_products
    data = []
    products = Product.all
    products.each do |p|
      liked = false
      if current_user
        favorite = Favorite.find_by_user_id_and_product_id(current_user.id, p.id)
---
SELECT "products".* FROM "products"
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."product_id" = ? LIMIT ?  [["user_id", 1], ["product_id", 2], ["LIMIT", 1]]

  def update_products
    if request.params[:id].blank? || request.params[:type].blank?
      render json: {"response" => "Bad Response"}
      return
    end

    if request.params[:type] == 'like'
      begin
        Favorite.create!([user_id: current_user.id, product_id: request.params[:id]])
      rescue => e
        render json: {"response" => "Bad Response"}
        ap "An error occured: #{e}"
        return
      end
    end

    if request.params[:type] == 'dislike'
      favorite = Favorite.find_by_user_id_and_product_id(current_user.id, request.params[:id])
      favorite.destroy
---
INSERT INTO "favorites" ("user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["product_id", 2], ["created_at", "2018-05-08 20:12:21.405065"], ["updated_at", "2018-05-08 20:12:21.405065"]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."product_id" = ? LIMIT ?  [["user_id", 1], ["product_id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]

  def favorite_products
    data = []
    favorites = Favorite.where(user_id: current_user.id)
    favorites.each do |f|
      p = Product.find_by_id(f.product_id)
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]