app/controllers/users/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "benkhair.youssef@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    if request.post?
      user = User.find_by(email: params[:user][:email])
      if !user
        begin
          user = User.create!(user_params)